outputs/aws/loadbalancer/haproxy/20000/ab_metrics10.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Caddy
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        24 bytes

Concurrency Level:      10
Time taken for tests:   18.571 seconds
Complete requests:      20000
Failed requests:        0
Total transferred:      5380000 bytes
HTML transferred:       480000 bytes
Requests per second:    1076.97 [#/sec] (mean)
Time per request:       9.285 [ms] (mean)
Time per request:       0.929 [ms] (mean, across all concurrent requests)
Transfer rate:          282.91 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       5
Processing:     1    9   3.8      9      49
Waiting:        0    9   3.8      8      48
Total:          1    9   3.8      9      49

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     10
  75%     11
  80%     12
  90%     14
  95%     15
  98%     18
  99%     21
 100%     49 (longest request)