outputs/aws/loadbalancer/haproxy/20000/ab_metrics2.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Caddy
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        24 bytes

Concurrency Level:      10
Time taken for tests:   18.504 seconds
Complete requests:      20000
Failed requests:        0
Total transferred:      5380000 bytes
HTML transferred:       480000 bytes
Requests per second:    1080.85 [#/sec] (mean)
Time per request:       9.252 [ms] (mean)
Time per request:       0.925 [ms] (mean, across all concurrent requests)
Transfer rate:          283.93 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       8
Processing:     1    9   4.5      8      82
Waiting:        0    9   4.4      8      82
Total:          1    9   4.5      9      82

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     10
  75%     11
  80%     11
  90%     13
  95%     16
  98%     21
  99%     27
 100%     82 (longest request)