outputs/aws/loadbalancer/haproxy/20000/ab_metrics3.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Caddy
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        24 bytes

Concurrency Level:      10
Time taken for tests:   18.503 seconds
Complete requests:      20000
Failed requests:        0
Total transferred:      5380000 bytes
HTML transferred:       480000 bytes
Requests per second:    1080.93 [#/sec] (mean)
Time per request:       9.251 [ms] (mean)
Time per request:       0.925 [ms] (mean, across all concurrent requests)
Transfer rate:          283.96 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       5
Processing:     1    9   3.2      9      33
Waiting:        1    9   3.1      8      33
Total:          1    9   3.2      9      33

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     10
  75%     11
  80%     12
  90%     13
  95%     15
  98%     17
  99%     18
 100%     33 (longest request)