outputs/aws/loadbalancer/haproxy/20000/ab_metrics6.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Caddy
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        24 bytes

Concurrency Level:      10
Time taken for tests:   18.132 seconds
Complete requests:      20000
Failed requests:        0
Total transferred:      5380000 bytes
HTML transferred:       480000 bytes
Requests per second:    1103.00 [#/sec] (mean)
Time per request:       9.066 [ms] (mean)
Time per request:       0.907 [ms] (mean, across all concurrent requests)
Transfer rate:          289.75 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       8
Processing:     1    9   3.7      8      82
Waiting:        0    9   3.7      8      82
Total:          1    9   3.7      9      82

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     10
  75%     11
  80%     11
  90%     13
  95%     15
  98%     18
  99%     21
 100%     82 (longest request)